# Задание N2 теперь мы с тобой напишем форму ввода ответа на тест по биологии для студентов. Он должен запрашивать по порядку этапы развития человека
# (проверим твое умение гуглить, что тоже очень важно для программиста.) и в конце вывести все стадии, разделенные знаком =>,
# что будет означать постепенный переход от одного к другому. В следующих уроках мы дополним эту форму до полноценного теста,
#  который будет проверять правильность ответов, а пока -начнем с малого. Напоминаем, что разделить эти данные тебе
#  поможет команда sep внутри команды print,
#  например, чтобы разделить переменные знаком + нужно ввести:  print(a1, a2, a3, sep='+')
# Подсказка: последняя стадия развития - Homo sapiens sapiens.


a1 = input("1 дриопитек")
a2 = input("2 рамапитек")
a3 = input("3 австралопитек")
a4 = input("4 человек умелый")
a5 = input("5 человек прямоходящий")
a6 = input("6 человек прямоходящий")
a7 = input("7 неандертальский человек")
a8 = input("8 homo sapiens")
print(a1, a2, a3, a4, a5, a6, a7, a8, sep="=>")



